In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
#get current working directory
cwd = os.getcwd()

#get file
file = cwd + '/data_source/census_data.csv'
data = pd.read_csv(file)

data.head()

#get file2
file2 = cwd + '/data_source/fruits.csv'
data2 = pd.read_csv(file2)
data2 = data2.set_index('fruit')

data2.head()

            qty    sales
fruit
apples       10   2000.0
mangoes      50      NaN
pears        30   7500.0
pineapples   23  25000.0
oranges      49   4000.0

In [3]:
#data subset
subset = data[["County","No. of Households"]]
subset.head()

      County  No. of Households
0    MOMBASA             268700
1      KWALE             122047
2     KILIFI             199764
3  TANARIVER              47414
4       LAMU              22184

In [4]:
#isolate rows
data[5:16]

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
5,TAITA TAVETA,71090,971,293.2,145334,139323,284657
6,GARISSA,98590,861,723.7,334939,288121,623060
7,WAJIR,88574,815,812.2,363766,298175,661941
8,MANDERA,125497,1038,988.2,559943,465813,1025756
9,MARSABIT,56941,653,445.9,151112,140054,291166
10,ISIOLO,31326,397,360.9,73694,69600,143294
11,MERU,319616,3196,424.4,670656,685645,1356301
12,THARAKA,88803,1102,331.5,178451,186879,365330
13,EMBU,131683,1296,398.3,254303,261909,516212
14,KITUI,205491,3587,282.3,481282,531427,1012709
15,MACHAKOS,264500,3052,360.0,543139,555445,1098584

## Conditional filtering (and, or)

In [5]:

data[(data['Population Density'] == 812.2) | (data['Population Density'] == 424.4)] #or

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
7,WAJIR,88574,815,812.2,363766,298175,661941
11,MERU,319616,3196,424.4,670656,685645,1356301

In [6]:
data[(data['Population Density'] == 812.2) & (data['Male'] >= 36000)] #and

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
7,WAJIR,88574,815,812.2,363766,298175,661941

## Drop column or row

In [7]:
#ensure it is indeed type is a dataframe
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [8]:
df.drop(df.index[0], inplace=True) #drop first row
df.drop(df.index[:5], inplace=True) #drop first five rows

df.head()

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
6,GARISSA,98590,861,723.7,334939,288121,623060
7,WAJIR,88574,815,812.2,363766,298175,661941
8,MANDERA,125497,1038,988.2,559943,465813,1025756
9,MARSABIT,56941,653,445.9,151112,140054,291166
10,ISIOLO,31326,397,360.9,73694,69600,143294

In [9]:
df.drop(['Area in Sq. Km.', 'No. of Households'], axis=1, inplace=True) #drop a or multiple column
df.head()

      County  Population Density    Male  Female    Total
6    GARISSA               723.7  334939  288121   623060
7      WAJIR               812.2  363766  298175   661941
8    MANDERA               988.2  559943  465813  1025756
9   MARSABIT               445.9  151112  140054   291166
10    ISIOLO               360.9   73694   69600   143294

## Indexing and Subsetting

In [10]:
data[20:26] #select from row 20 onwards

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
20,MURANGA,255696,2517,374.5,457864,484717,942581
21,KIAMBU,469244,4946,328.2,802609,820673,1623282
22,TURKANA,123191,1520,562.8,445069,410330,855399
23,WEST POKOT,93777,1407,364.4,254827,257863,512690
24,SAMBURU,47354,542,413.2,112007,111940,223947
25,TRANS-NZOIA,170117,1611,508.2,407172,411585,818757

In [11]:
data[::2] #select entries whose index is even

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
0,MOMBASA,268700,3079,305.1,486924,452446,939370
2,KILIFI,199764,2343,473.6,535526,574209,1109735
4,LAMU,22184,265,383.2,53045,48494,101539
6,GARISSA,98590,861,723.7,334939,288121,623060
8,MANDERA,125497,1038,988.2,559943,465813,1025756
10,ISIOLO,31326,397,360.9,73694,69600,143294
12,THARAKA,88803,1102,331.5,178451,186879,365330
14,KITUI,205491,3587,282.3,481282,531427,1012709
16,MAKUENI,186478,2344,377.4,430710,453817,884527
18,NYERI,201703,2077,333.9,339725,353833,693558
20,MURANGA,255696,2517,374.5,457864,484717,942581
22,TURKANA,123191,1520,562.8,445069,410330,855399
24,SAMBURU,47354,542,413.2,112007,111940,223947
26,UASIN GISHU,202291,2112,423.4,448994,445185,894179
28,NANDI,154073,1777,423.7,376488,376477,752965
30,LAIKIPIA,103114,1023,390.3,198625,200602,399227
32,NAROK,169220,1852,459.5,429026,421894,850920
34,BOMET,142361,1630,444.3,359727,364459,724186
36,KAKAMEGA,355679,3343,496.8,800989,859662,1660651
38,BUNGOMA,321628,3123,522.2,710510,835339,1630934
40,SIAYA,199034,2183,385.9,398652,443652,842304
42,HOMA BAY,160935,1754,427.2,357273,392058,749331
44,KISII,245029,2588,445.2,550464,601818,1152282
46,NAIROBI,985016,10323,304.0,1605230,1533139,3138369

In [12]:
data.iloc[0:10, 1:4] #row and column slicing using iloc - index location

   No. of Households  Area in Sq. Km.  Population Density
0             268700             3079               305.1
1             122047             1265               513.8
2             199764             2343               473.6
3              47414              626               383.5
4              22184              265               383.2
5              71090              971               293.2
6              98590              861               723.7
7              88574              815               812.2
8             125497             1038               988.2
9              56941              653               445.9

In [13]:
data.loc[[0,5,10], ['County','Population Density','Male', 'Female','Total']] #show which rows and columns using loc - name location

          County  Population Density    Male  Female   Total
0        MOMBASA               305.1  486924  452446  939370
5   TAITA TAVETA               293.2  145334  139323  284657
10        ISIOLO               360.9   73694   69600  143294

In [14]:
data[['County', 'Male', 'Female', 'Total']][5:10] #subset column by row using name location

         County    Male  Female    Total
5  TAITA TAVETA  145334  139323   284657
6       GARISSA  334939  288121   623060
7         WAJIR  363766  298175   661941
8       MANDERA  559943  465813  1025756
9      MARSABIT  151112  140054   291166

In [15]:
data[10:21] #subset by rows

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
10,ISIOLO,31326,397,360.9,73694,69600,143294
11,MERU,319616,3196,424.4,670656,685645,1356301
12,THARAKA,88803,1102,331.5,178451,186879,365330
13,EMBU,131683,1296,398.3,254303,261909,516212
14,KITUI,205491,3587,282.3,481282,531427,1012709
15,MACHAKOS,264500,3052,360.0,543139,555445,1098584
16,MAKUENI,186478,2344,377.4,430710,453817,884527
17,NYANDARUA,143879,1259,473.6,292155,304113,596268
18,NYERI,201703,2077,333.9,339725,353833,693558
19,KIRINYAGA,154220,1401,376.9,260630,267424,528054
20,MURANGA,255696,2517,374.5,457864,484717,942581

In [16]:
data.head(10)

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
0,MOMBASA,268700,3079,305.1,486924,452446,939370
1,KWALE,122047,1265,513.8,315997,333934,649931
2,KILIFI,199764,2343,473.6,535526,574209,1109735
3,TANARIVER,47414,626,383.5,119853,120222,240075
4,LAMU,22184,265,383.2,53045,48494,101539
5,TAITA TAVETA,71090,971,293.2,145334,139323,284657
6,GARISSA,98590,861,723.7,334939,288121,623060
7,WAJIR,88574,815,812.2,363766,298175,661941
8,MANDERA,125497,1038,988.2,559943,465813,1025756
9,MARSABIT,56941,653,445.9,151112,140054,291166

In [17]:
data2.head(3)

         qty   sales
fruit
apples    10  2000.0
mangoes   50     NaN
pears     30  7500.0

In [18]:
data2[2:4]

            qty    sales
fruit
pears        30   7500.0
pineapples   23  25000.0

In [20]:
data[data.County == 'MOMBASA'] #isolate by row names

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
0,MOMBASA,268700,3079,305.1,486924,452446,939370

In [23]:
data.loc[data['County'].isin(['KWALE', 'MOMBASA', 'MURANGA'])] #isolate by row labels

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
0,MOMBASA,268700,3079,305.1,486924,452446,939370
1,KWALE,122047,1265,513.8,315997,333934,649931
20,MURANGA,255696,2517,374.5,457864,484717,942581

In [26]:
data[(data['No. of Households'] >= 26000) & (data['Population Density'] >= 300)]

,County,No. of Households,Area in Sq. Km.,Population Density,Male,Female,Total
0,MOMBASA,268700,3079,305.1,486924,452446,939370
1,KWALE,122047,1265,513.8,315997,333934,649931
2,KILIFI,199764,2343,473.6,535526,574209,1109735
3,TANARIVER,47414,626,383.5,119853,120222,240075
6,GARISSA,98590,861,723.7,334939,288121,623060
7,WAJIR,88574,815,812.2,363766,298175,661941
8,MANDERA,125497,1038,988.2,559943,465813,1025756
9,MARSABIT,56941,653,445.9,151112,140054,291166
10,ISIOLO,31326,397,360.9,73694,69600,143294
11,MERU,319616,3196,424.4,670656,685645,1356301
12,THARAKA,88803,1102,331.5,178451,186879,365330
13,EMBU,131683,1296,398.3,254303,261909,516212
15,MACHAKOS,264500,3052,360.0,543139,555445,1098584
16,MAKUENI,186478,2344,377.4,430710,453817,884527
17,NYANDARUA,143879,1259,473.6,292155,304113,596268
18,NYERI,201703,2077,333.9,339725,353833,693558
19,KIRINYAGA,154220,1401,376.9,260630,267424,528054
20,MURANGA,255696,2517,374.5,457864,484717,942581
21,KIAMBU,469244,4946,328.2,802609,820673,1623282
22,TURKANA,123191,1520,562.8,445069,410330,855399
23,WEST POKOT,93777,1407,364.4,254827,257863,512690
24,SAMBURU,47354,542,413.2,112007,111940,223947
25,TRANS-NZOIA,170117,1611,508.2,407172,411585,818757
26,UASIN GISHU,202291,2112,423.4,448994,445185,894179
27,ELGIYO MARAKWET,77555,1107,334.2,183738,186260,369998
28,NANDI,154073,1777,423.7,376488,376477,752965
30,LAIKIPIA,103114,1023,390.3,198625,200602,399227
31,NAKURU,409836,4650,344.8,804582,798743,1603325
32,NAROK,169220,1852,459.5,429026,421894,850920
33,KAJIADO,173464,1105,351.6,345146,342166,687312
34,BOMET,142361,1630,444.3,359727,364459,724186
35,KERICHO,160134,1886,402.1,381980,376359,758339
36,KAKAMEGA,355679,3343,496.8,800989,859662,1660651
37,VIHIGA,123347,1271,436.4,262716,291906,554622
38,BUNGOMA,321628,3123,522.2,710510,835339,1630934
39,BUSIA,103421,1171,416.8,232075,256000,488075
40,SIAYA,199034,2183,385.9,398652,443652,842304
41,KISUMU,226719,2407,402.5,474760,494149,968909
42,HOMA BAY,160935,1754,427.2,357273,392058,749331
43,MIGORI,41800,489,523.7,125938,130148,256086
44,KISII,245029,2588,445.2,550464,601818,1152282
45,NYAMIRA,131039,1291,463.4,287048,311204,598252
46,NAIROBI,985016,10323,304.0,1605230,1533139,3138369